{"id":"tt1016320","title":"The Disastrous Dardanelles Expedition","originalTitle":"With the Dardanelles Expedition","fullTitle":"The Disastrous Dardanelles Expedition (1916)","type":"Movie","year":"1916","image":"https://imdb-api.com/images/original/nopicture.jpg","releaseDate":"1916-03-05","runtimeMins":"PT20M","runtimeStr":"PT20M","plot":"What happened at Gallipoli? Did the British troops evacuate the peninsula with the loss of but one man? Or did they suffer the loss of 30 per cent of their effectives when they withdrew their ill-fated expedition against Turkey? Perhaps the most spectacular campaign of the whole war was that at the Dardanelles. The sinking of great English dreadnoughts as they attempted to force the passage to Constantinople, the slaughter of hundreds of thousands of English, Colonial and Turkish troops in the \"Graveyard of the East,\" and the final mysterious withdrawal from the costly venture by the French and English forces, all make the war film, \"The Disastrous Dardanelles Expedition,\" a feature of the most soul-stirring interest. These pictures were secured by Ashmead Bartlett, the famous war correspondent, who was able to penetrate into the peninsula with the troops. The scenes show thrilling Suvin Bay operations, the repulsing of a Turkish attack, the destruction of the position occupied by the famous Australian and New Zealand contingents (the Anzacs), the terrific slaughter at the famous Fort Sed-il-Bahr and other pictures showing the transportation of troops from Lemnos, the British hospital station and military base, the various landings on the peninsula. These landings were the most costly ventures the expedition experienced. Thousands of men were mowed down as they disembarked from the pontoon barges. The Turks, as they lay entrenched on the tops of hills, literally swept the troops from the boats into the water with their withering fire. It speaks well for the extraordinary bravery of the British that they were able to land at all.","plotLocal":"","plotLocalIsRtl":false,"awards":"","directors":"","directorList":[],"writers":"","writerList":[],"stars":"","starList":[],"actorList":[],"fullCast":null,"genres":"Documentary, Short, War","genreList":[{"key":"Documentary","value":"Documentary"},{"key":"Short","value":"Short"},{"key":"War","value":"War"}],"companies":"","companyList":[],"countries":"UK","countryList":[{"key":"UK","value":"UK"}],"languages":"None, English","languageList":[{"key":"None","value":"None"},{"key":"English","value":"English"}],"contentRating":null,"imDbRating":null,"imDbRatingVotes":null,"metacriticRating":null,"ratings":null,"wikipedia":null,"posters":null,"images":null,"trailer":null,"boxOffice":{"budget":"","openingWeekendUSA":"","grossUSA":"","cumulativeWorldwideGross":""},"tagline":null,"keywords":"year 1916,1910s,20th century,battle of gallipoli,world war one","keywordList":["year 1916","1910s","20th century","battle of gallipoli","world war one"],"similars":[],"tvSeriesInfo":null,"tvEpisodeInfo":null,"errorMessage":null}
