{"id":"tt1164632","title":"The Poor Student","originalTitle":"","fullTitle":"The Poor Student (1910)","type":"Movie","year":"1910","image":"https://imdb-api.com/images/original/nopicture.jpg","releaseDate":"1910-12-15","runtimeMins":null,"runtimeStr":null,"plot":"John Shay, the son of a widow in very moderate circumstances, decides to go to college and work his way through. Arriving in the college town, he is directed to a boarding house, but when he enters and learns from the landlady her rates, which are quite high, he explains to her his scarcity of money and starts to go away. She, however, liking his manners and appearance, proposes that he remain and act as waiter for her at meal time, in exchange for his board and lodging, and he, not being proud, accepts. The college is a co-educational institution and at the boarding house are number of young lady students. Among this number are Hazel Jones and Isabelle Smith, the latter, a very popular girl, but one possessing a very haughty disposition. John imagines himself in love with Isabelle, and in order to give vent to his feelings, purchases for her out of his slim savings a bunch of violets. This he fondly lays at her place at the table. When meal time arrives and all gather at the table, Isabelle discovers the violets and, very greatly pleased, inquires of the various boys if they know who left them for her. One of the young men happened to see John place the violets at her plate and informs her of that fact. This so incenses her that she leaps to her feet, and throwing the flowers angrily to the floor, proudly leaves the room, giving John a contemptuous look as she passes him. Hazel, who has closely observed the affair, feeling a deep sympathy for John, rises and picking up the violets asks his permission to keep them. This, of course, he gratefully grants her. He then, realizing the vast difference in the character of the two girls, lets his heart go out to the one who showed him such delicately expressed sympathy. He also realizes most fully the humiliating position he occupies at the school and decides to go away and seek his fortune elsewhere. Expressing this determination to his best man friend in the college, the friend decides to join forces with him and the two leave for the mining fields. After great discouragement, they finally strike a rich placer, and selling it advantageously, they return once more to the haunts of men. John, now being a rich man, at once seeks out the little girl who proved a true friend. He arrives at the college in his automobile, and going to the front of the boarding house, gets out. Hazel and Isabelle happen to be sitting together on the front steps, going over their lessons. They both see John, but as he advances Hazel shrinks back, but Isabelle runs forward to greet him, having observed the style in which he has arrived. Going politely past Isabelle's outstretched hand, which he coolly ignores, he goes up to Hazel and takes her timid little hand in both of his. Of course Hazel loves him, how could she help it? And how proud John's mother is of his little \"co-ed\" wife.","plotLocal":"","plotLocalIsRtl":false,"awards":"","directors":"","directorList":[],"writers":"","writerList":[],"stars":"","starList":[],"actorList":[],"fullCast":null,"genres":"Short, Drama, Romance","genreList":[{"key":"Short","value":"Short"},{"key":"Drama","value":"Drama"},{"key":"Romance","value":"Romance"}],"companies":"Independent Moving Pictures Co. of America (IMP)","companyList":[{"id":"co0081887","name":"Independent Moving Pictures Co. of America (IMP)"}],"countries":"USA","countryList":[{"key":"USA","value":"USA"}],"languages":"None, English","languageList":[{"key":"None","value":"None"},{"key":"English","value":"English"}],"contentRating":null,"imDbRating":null,"imDbRatingVotes":null,"metacriticRating":null,"ratings":null,"wikipedia":null,"posters":null,"images":null,"trailer":null,"boxOffice":{"budget":"","openingWeekendUSA":"","grossUSA":"","cumulativeWorldwideGross":""},"tagline":null,"keywords":"","keywordList":[],"similars":[],"tvSeriesInfo":null,"tvEpisodeInfo":null,"errorMessage":null}
