{"id":"tt1286781","title":"The Doctor's Sacrifice","originalTitle":"","fullTitle":"The Doctor's Sacrifice (1913)","type":"Movie","year":"1913","image":"https://imdb-api.com/images/original/nopicture.jpg","releaseDate":"1913-09-30","runtimeMins":null,"runtimeStr":null,"plot":"Mr. and Mrs. Bristowe are entertaining a party of friends to dinner at their country residence, Briarwood, when one of the servants rushes in to tell them that their daughter, Lillie, has been taken suddenly ill. A hastily summoned nurse diagnoses the case as one of acute diphtheria. Mr. Bristowe, alarmed at the seriousness of the ailment with which their only child is stricken, telephones to Dr. Browne to come at once. The doctor starts immediately in his automobile, but is seriously inconvenienced by a sudden breakdown. The urgency of the case determines him to take a short cut through the woods to Briarwood, as the way is easy for him. Unfortunately he trips over a fallen log, and his right hand is caught in a wolf-trap. Release is only possible by amputation of his fingers, and he sacrifices these in order to reach the child in time. The great sacrifice thus made enables him to successfully treat little Lillie's dread disease, and as the dawn breaks he is able to assure the tortured parents that their darling will recover. Later on Lillie is playing with Dr. Browne, and seeing his right arm still bound up, it seems that she senses what a noble deed the doctor performed in the wood, and the child tenderly raises the stricken hand and presses her lips to it.","plotLocal":"","plotLocalIsRtl":false,"awards":"","directors":"","directorList":[],"writers":"","writerList":[],"stars":"","starList":[],"actorList":[],"fullCast":null,"genres":"Short, Drama","genreList":[{"key":"Short","value":"Short"},{"key":"Drama","value":"Drama"}],"companies":"Gaumont Company","companyList":[{"id":"co0130980","name":"Gaumont Company"}],"countries":"USA","countryList":[{"key":"USA","value":"USA"}],"languages":"None, English","languageList":[{"key":"None","value":"None"},{"key":"English","value":"English"}],"contentRating":null,"imDbRating":null,"imDbRatingVotes":null,"metacriticRating":null,"ratings":null,"wikipedia":null,"posters":null,"images":null,"trailer":null,"boxOffice":{"budget":"","openingWeekendUSA":"","grossUSA":"","cumulativeWorldwideGross":""},"tagline":null,"keywords":"","keywordList":[],"similars":[],"tvSeriesInfo":null,"tvEpisodeInfo":null,"errorMessage":null}
